{
    "title": "EN",
    "name": "Dragoș-Andrei Iliescu",
    "job": "Full-Stack Engineer",
    "education": "Education",
    "navbar.resume": "Resume",
    "navbar.about": "About",
    "education.university": "Transilvania University of Brașov",
    "education.university.location": "Brașov, Romania",
    "education.university.date": " Oct 2015 - Sep 2018",
    "education.university.line1": "BSc in Computer Science",
    "education.university.line2": "Relevant modules: Data structures and algorithms, Database management systems, Embedded systems, Distributed systems, C++, Python, Swift, JavaScript, Java, C#, .NET, WPF, UWP, WebAPI, Entity Framework, Spring, Android",
    "education.highschool": "'Spiru Haret' National College",
    "education.highschool.location": "Ploiesti, Romania",
    "education.highschool.date": " Sep 2011 - Sep 2015",
    "education.highschool.line1": "Mathematics and Programming profile with intensive Programming classes",
    "education.highschool.line2": "Participated in various Mathematics and Programming contests",
    "education.highschool.line3": "Achieved a perfect score (10/10) in Mathematics on the Baccalaureate exam",
    "experience": "Experience",
    "experience.allround": "IT Consultant, Allround Zonwering",
    "experience.allround.location": "Elburg, Netherlands (Remote)",
    "experience.allround.date": "Sep 2021 - Aug 2023",
    "experience.allround.line1": "Developed an ERP application to manage the client's complete business process, including factory and office operations",
    "experience.allround.line2": "Used NX for Angular to streamline and manage the microservices architecture.",
    "experience.allround.line3": "Developed the base for the web application's architecture, including core modules and components, utilities, layout and theme, security library etc.",
    "experience.allround.line4": "Deployed Angular and .NET microservices on client servers with Azure DevOps integrations.",
    "experience.allround.line5": "Set up and optimized Azure DevOps CI/CD pipelines, including pull request workflows, builds, and releases. Managed deployment environments and authored shell scripts for in the process.",
    "experience.codecrowd": "Full-Stack Engineer, The Code Crowd",
    "experience.codecrowd.location": "Nunspeet, Netherlands (Remote)",
    "experience.codecrowd.date": "Nov 2017 - Aug 2021",
    "experience.codecrowd.line1": "Worked in an international team to develop business applications for clients across the Netherlands.",
    "experience.codecrowd.line2": "My initial role was focused on addressing small bugs and implementing minor features, rapidly advancing to more complex problems and features.",
    "experience.codecrowd.line3": "My primary role was to designed and implemented business logic and user interfaces in Angular, but I was involved in all aspects of development.",
    "experience.codecrowd.line4": "Managed the end-to-end development of business features, including front-end and back-end implementation.",
    "experience.codecrowd.line5": "Managed the creation and optimization of core components and modules, reusable elements and the integration of new functionalities into shared modules, being in charge of the involved architectural decisions.",
    "experience.codecrowd.line6": "Developed a NativeScript application with Firebase integration. The app was used for employee schedule management, enabling users to manage different activities during their working times.",
    "experience.codecrowd.line7": "Took an active role in the entire development process, including requirement gathering and feature planning within an Agile environment, participating in Scrum activities, including sprint planning, backlog refinement, and sprint reviews.",
    "experience.buzzwords.key": "Buzzwords",
    "experience.buzzwords.value": ".NET Core, Web API, EF Core, SignalR, Swagger, MSSQL, Angular, Reactive Forms, Angular Material, RxJS, NativeScript, Azure, CI/CD, Agile, Scrum, Shell scripting, Firebase",
    "experience.languages.key": "Languages",
    "experience.languages.value": "Spanish (intermediate), English (fluent), Romanian (native)",
    "volunteering": "Volunteering",
    "volunteering.itsupport": "Transilvania University IT Support Department",
    "volunteering.itsupport.location": "Brașov, Romania",
    "volunteering.itsupport.date": "Oct 2016 - Sep 2018",
    "volunteering.itsupport.line1": "Provided on site technical support across all university departments using a ticket-based system, ensuring minimal downtime for university operations.",
    "volunteering.itsupport.line2": "Addressed both technical and hardware issues such as network connectivity, device malfunctions, software and hardware setups, computer performance, etc.",
    "volunteering.itsupport.line3": "Interviewed and onboarded new students in the team, guiding and mentoring the new members of the group."
}