{
  "resume.title": "Dragoș-Andrei Iliescu",
  "resume.subtitle": "Full-Stack Engineer",
  "labels.resume.download": "Download CV",
  "resume.sections.about.short_intro": "Full-stack software engineer with over 5 years of hands-on experience developing scalable business web applications",
  "resume.sections.about.buzzwords.key": "Buzzwords",
  "resume.sections.about.buzzwords.value": "C#, .NET Core, Web API, EF Core, SignalR, Swagger, MSSQL, Typescript, Angular, Reactive Forms, Angular Material, RxJS, NX, NativeScript, Azure Cloud Services, Azure DevOps, CI/CD, Agile, Scrum, Shell scripting, Firebase",
  "resume.sections.about.languages.key": "Languages",
  "resume.sections.about.languages.value": "Spanish  (intermediate), English (fluent), Romanian (native)",
  "resume.sections.experience.allround.date": "Sep 2021 - Aug 2023",
  "resume.sections.experience.allround.lines": [
    "Developed an ERP application to manage the client's complete business process, including factory and office operations",
    "Used NX for Angular to streamline and manage the microservices architecture.",
    "Developed the base for the web application's architecture, including core modules and components, utilities, layout and theme, security library etc.",
    "Deployed Angular and .NET microservices on client servers with Azure DevOps integrations.",
    "Set up and optimized Azure DevOps CI/CD pipelines, including pull request workflows, builds, and releases. Managed deployment environments and authored shell scripts for in the process."
  ],
  "resume.sections.experience.allround.title": "IT Consultant, Allround Zonwering",
  "resume.sections.experience.allround.location": "Elburg, Netherlands (Remote)",
  "resume.sections.experience.codecrowd.date": "Nov 2017 - Aug 2021",
  "resume.sections.experience.codecrowd.lines": [
    "Managed the end-to-end development of business features, including front-end and back-end implementation.",
    "Managed the creation and optimization of core components and modules, reusable elements and the integration of new functionalities into shared modules, being in charge of the involved architectural decisions.",
    "Developed a NativeScript application with Firebase integration. The app was used for employee schedule management, enabling users to manage different activities during their working times.",
    "Took an active role in the entire development process, including requirement gathering and feature planning within an Agile environment, participating in Scrum activities, including sprint planning, backlog refinement, and sprint reviews."
  ],
  "resume.sections.experience.codecrowd.title": "Full-Stack Engineer, The Code Crowd",
  "resume.sections.experience.codecrowd.location": "Nunspeet, Netherlands (Remote)",
  "resume.sections.experience.label": "Experience",
  "resume.sections.volunteering.itsupport.date": "Oct 2016 - Sep 2018",
  "resume.sections.volunteering.itsupport.lines": [
    "Provided on site technical support across all university departments using a ticket-based system, ensuring minimal downtime for university operations."
  ],
  "resume.sections.volunteering.itsupport.title": "Transilvania University IT Support Department",
  "resume.sections.volunteering.itsupport.location": "Brașov, Romania",
  "resume.sections.volunteering.label": "Volunteering",
  "resume.sections.education.university.date": "Oct 2015 - Sep 2018",
  "resume.sections.education.university.lines": [
    "BSc in Computer Science",
    "Relevant modules: Data structures and algorithms, Database management systems, Embedded systems, Distributed systems, C++, Python, Swift, JavaScript, Java, C#, .NET, WPF, UWP, WebAPI, Entity Framework, Spring, Android"
  ],
  "resume.sections.education.university.title": "Transilvania University of Brașov",
  "resume.sections.education.university.location": "Brașov, Romania",
  "resume.sections.education.label": "Education",
  "about.sections.intro.lines": [
    "I'm a Full-Stack software engineer with over 5 years of experience in building enterprise applications. I started my career focusing on back-end development but quickly found a passion for front-end work. I now specialize in creating responsive and user-friendly interfaces, though I still enjoy working sever-side work, be it building RESTful APIs, configuring some infrastructure, reading some logs to find a bug or anything in between.",
    "I have hands-on experience with Angular, .NET Core, and Azure. I'm comfortable working in both Windows and Unix environments and I feel right at home in the shell. I have worked on a variety of business projects in an Agile environment, where I have had the opportunity to wear many hats, including project management, sprint planning, and client communication.",
    "My work has actively involved close collaboration between teams, monitoring our progress and making sure we deliver on time and making sure everyone is on the same page. I have a strong focus on quality and I'm always eager to learn new ways to improve my skills."
  ],
  "about.greeting": "Hi. I'm Dragoș, nice to meet you!",
  "labels.sections.about": "About",
  "labels.sections.resume": "Resume",
  "labels.sections.blog": "Blog",
  "labels.themepicker.name": "Colors",
  "labels.themepicker.flamingo_gleam": "Flamingo Gleam",
  "labels.themepicker.dolphin_dream": "Dolphin Dream"
}