{
  "resume.title": "Dragoș-Andrei Iliescu",
  "resume.subtitle": "Full-Stack Engineer",
  "resume.sections.about.short_intro": "Full-stack software engineer with over 5 years of hands-on experience developing scalable business web applications.",
  "resume.sections.about.buzzwords.key": "Technologies",
  "resume.sections.about.buzzwords.value": "C#, .NET Core, EF Core, SignalR, Swagger, MSSQL, Typescript, Angular, RxJS, NX, NativeScript, Azure DevOps, CI/CD, Firebase",
  "resume.sections.about.languages.key": "Languages",
  "resume.sections.about.languages.value": "Spanish  (intermediate), English (fluent), Romanian (native)",
  "resume.sections.experience.allround.title": "Full-Stack Engineer, Allround Zonwering",
  "resume.sections.experience.allround.location": "Elburg, Netherlands (Remote)",
  "resume.sections.experience.codecrowd.date": "Nov 2017 - Aug 2021",
  "resume.sections.experience.allround.date": "Sep 2021 - Aug 2023",
  "resume.sections.experience.codecrowd.lines": [
    "Implemented end-to-end features for employee-oriented applications, such as different types of dashboards, CRM development, sales systems, inventory management, human resources management, among others.",
    "Worked in an Agile environment, actively participating in the planning and execution of sprints, as well as prioritizing tasks according to project objectives.",
    "Developed custom functionalities based on the specific needs of each company.",
    "Automated workflows to improve efficiency and reduce errors in data entry.",
    "Optimized performance in applications, ensuring fast load times and a smooth user experience.",
    "Conducted continuous improvement of existing applications, performing code refactoring to increase software efficiency and maintainability.",
    "Analyzed logs and monitored cloud environments to ensure system stability, carrying out bug-fixing and stabilization sprints.",
    "Designed and implemented a mobile application for Boer BV employees, allowing them to log their daily activities and plan their work. The application facilitated the management and organization of workers' day-to-day tasks, integrating stock updates and real-time order management, and improving efficiency in coordinating operations."
  ],
  "resume.sections.experience.allround.lines": [
    "Worked on developing a microservices system that drives all company operations.",
    "The system manages key business functions, including CRM, human resources, sales, purchasing, and factory production, with specific adaptations for tablet screens used in cutting machines, powder coating, assembly lines, etc.",
    "Developed the architectural foundation of the Frontend using Angular and NX, incorporating security modules and establishing the fundamental infrastructure on which the application was built.",
    "Designed a complex product configurator for the sales team, allowing for product customization according to specifications.",
    "Implemented CI/CD pipelines to automate deployments and improve efficiency in the software delivery process.",
    "Participated in organizing sprints, gathering requirements, and planning features, managing development time to define priorities and ensure alignment with client needs.",
    "Carried out end-to-end implementations and post-deployment monitoring to ensure the quality and consistency of the software."
  ],
  "resume.sections.experience.codecrowd.title": "Full-Stack Engineer, The Code Crowd",
  "resume.sections.experience.codecrowd.location": "Nunspeet, Netherlands (Remote)",
  "resume.sections.experience.label": "Experience",
  "resume.sections.volunteering.itsupport.date": "Oct 2016 - Sep 2018",
  "resume.sections.volunteering.itsupport.lines": [
    "Provided on site technical support across all university departments using a ticket-based system, ensuring minimal downtime for university operations."
  ],
  "resume.sections.volunteering.itsupport.title": "University IT Support",
  "resume.sections.volunteering.itsupport.location": "Brașov, Romania",
  "resume.sections.volunteering.label": "Volunteering",
  "resume.sections.education.university.date": "Oct 2015 - Sep 2018",
  "resume.sections.education.university.lines": [
    "BSc in Computer Science"
  ],
  "resume.sections.education.university.title": "Transilvania University of Brașov",
  "resume.sections.education.university.location": "Brașov, Romania",
  "resume.sections.education.label": "Education",
  "editor.paragraph": "Paragraph",
  "editor.heading1": "Heading 1",
  "editor.heading2": "Heading 2",
  "editor.heading3": "Heading 3",
  "editor.bold": "Bold",
  "editor.italic": "Italic",
  "editor.underline": "Underline",
  "editor.removeFormat": "Clear styles",
  "editor.alignLeft": "Align left",
  "editor.alignCenter": "Align center",
  "editor.alignRight": "Align right",
  "editor.indentLeft": "Decrease indent",
  "editor.indentRight": "Increase indent",
  "editor.hideSource": "Hide Source",
  "editor.showSource": "Show Source",
  "timeAgo.justNow": "Just now",
  "authWidget.greeting": "Hello, welcome!",
  "authWidget.writePost": "Write a post",
  "authWidget.signInToWrite": "Sign in to write",
  "authWidget.manageProfile": "Manage profile",
  "authWidget.signOut": "Sign out",
  "authWidget.signInWithGoogle": "Sign in with Google",
  "account.manage.title": "Manage Account",
  "account.manage.subtitle": "Edit account details",
  "account.manage.changePicture": "Change picture",
  "account.manage.name": "Name",
  "account.manage.errors.usernameRequired": "Username is required",
  "account.manage.errors.usernameMinlength": "Username must be at least 3 characters",
  "account.manage.email": "Email",
  "account.manage.save": "Save changes",
  "about.greeting": "Hi. I'm Dragoș, nice to meet you!",
  "editor.textColor": "Text Color",
  "editor.backgroundColor": "Background Color",
  "editor.resetTextColor": "Reset Text Color",
  "editor.resetBackgroundColor": "Reset Background Color",
  "labels.resume.download": "Download CV",
  "labels.resume.location": "Valencia, Spain",
  "about.sections.intro.lines": [
    "Full-Stack Developer with over 5 years of experience creating scalable and functional enterprise web applications. Self-taught, independent, and passionate about technology, I have strong skills in Angular, .NET Core, and Azure Cloud, with expertise in both front-end and back-end development. My quick learning ability allows me to adapt to various technologies and meet the requirements of each project.",
    "My experience includes the development of ERP applications, encompassing factory operations, internal management such as CRM, project management, human resources, sales, stock management, and product design. Additionally, I have experience developing mobile applications with NativeScript.",
    "I consider myself adept at Clean Code principles, such as readability, simplicity, modularity, and code efficiency. I have solid knowledge of git and feel comfortable working in the terminal, with a deep understanding of UNIX and Windows systems. In Azure DevOps, I have designed custom CI/CD pipelines and implemented automations to optimize workflows. I have worked in international environments applying Agile methodologies, collaborating especially with teams and clients from the Netherlands, thanks to my command of English.",
    "I am most satisfied when my work adds direct value to end-users. Both code quality and user experience are equally important to me, and I like to have a clear view of the big picture while also paying close attention to the smallest details. I am a team player, a lifelong learner, and a firm believer in the power of positive thinking.",
    "I believe we should never stop being students of life. Learning new things and refining our skills is a lifelong journey one embarks on if they want to savor the sweet fruits this world has to offer."
  ],
  "labels.sections.about": "About",
  "labels.sections.resume": "Resume",
  "labels.themepicker.name": "Colors",
  "labels.themepicker.flamingo_gleam": "Flamingo Gleam",
  "labels.themepicker.dolphin_dream": "Dolphin Dream",
  "timeAgo": {
    "justNow": "Just now",
    "minute": "a minute ago",
    "minutes": "{{count}} minutes ago",
    "hour": "an hour ago",
    "hours": "{{count}} hours ago",
    "day": "yesterday",
    "days": "{{count}} days ago",
    "week": "a week ago",
    "weeks": "{{count}} weeks ago",
    "month": "a month ago",
    "months": "{{count}} months ago",
    "year": "a year ago",
    "years": "{{count}} years ago"
  }
}