{
  "themepicker.title": "Theme",
  "navbar.about": "About",
  "navbar.resume": "Resume",
  "about": "About",
  "resume.about.line1": "Full-stack software engineer with over 5 years of hands-on experience developing scalable business web applications.'",
  "resume.about.line2": "I'm a strong advocate for clean, maintainable code and believe in thinking twice before coding. I'm a team player, a lifelong seeker, and a firm believer in the power of positive thinking.",
  "experience.buzzwords.key": "Buzzwords",
  "experience.buzzwords.value": "C#, .NET Core, Web API, EF Core, SignalR, Swagger, MSSQL, Typescript, Angular, Reactive Forms, Angular Material, RxJS, NX, NativeScript, Azure Cloud Services, Azure DevOps, CI/CD, Agile, Scrum, Shell scripting, Firebase",
  "experience.languages.key": "Languages",
  "experience.languages.value": "Spanish  - intermediate, English - fluent, Romanian - native",
  "experience": "Experience",
  "experience.allround": "IT Consultant, Allround Zonwering",
  "experience.allround.location": "Elburg, Netherlands (Remote)",
  "experience.allround.date": "Sep 2021 - Aug 2023",
  "experience.allround.line1": "Developed an ERP application to manage the client's complete business process, including factory and office operations",
  "experience.allround.line2": "Used NX for Angular to streamline and manage the microservices architecture.",
  "experience.allround.line3": "Developed the base for the web application's architecture, including core modules and components, utilities, layout and theme, security library etc.",
  "experience.allround.line4": "Deployed Angular and .NET microservices on client servers with Azure DevOps integrations.",
  "experience.allround.line5": "Set up and optimized Azure DevOps CI/CD pipelines, including pull request workflows, builds, and releases. Managed deployment environments and authored shell scripts for in the process.",
  "experience.codecrowd": "Full-Stack Engineer, The Code Crowd",
  "experience.codecrowd.location": "Nunspeet, Netherlands (Remote)",
  "experience.codecrowd.date": "Nov 2017 - Aug 2021",
  "experience.codecrowd.line1": "Worked in an international team to develop business applications for clients across the Netherlands.",
  "experience.codecrowd.line2": "My initial role was focused on addressing small bugs and implementing minor features, rapidly advancing to more complex problems and features.",
  "experience.codecrowd.line3": "My primary role was to designed and implemented business logic and user interfaces in Angular, but I was involved in all aspects of development.",
  "experience.codecrowd.line4": "Managed the end-to-end development of business features, including front-end and back-end implementation.",
  "experience.codecrowd.line5": "Managed the creation and optimization of core components and modules, reusable elements and the integration of new functionalities into shared modules, being in charge of the involved architectural decisions.",
  "experience.codecrowd.line6": "Developed a NativeScript application with Firebase integration. The app was used for employee schedule management, enabling users to manage different activities during their working times.",
  "experience.codecrowd.line7": "Took an active role in the entire development process, including requirement gathering and feature planning within an Agile environment, participating in Scrum activities, including sprint planning, backlog refinement, and sprint reviews.",
  "volunteering": "Volunteering",
  "volunteering.itsupport": "Transilvania University IT Support Department",
  "volunteering.itsupport.location": "Brașov, Romania",
  "volunteering.itsupport.date": "Oct 2016 - Sep 2018",
  "volunteering.itsupport.line1": "Provided on site technical support across all university departments using a ticket-based system, ensuring minimal downtime for university operations.",
  "volunteering.itsupport.line2": "Addressed both technical and hardware issues such as network connectivity, device malfunctions, software and hardware setups, computer performance, etc.",
  "volunteering.itsupport.line3": "Interviewed and onboarded new students in the team, guiding and mentoring the new members of the group.",
  "education": "Education",
  "education.university": "Transilvania University of Brașov",
  "education.university.location": "Brașov, Romania",
  "education.university.date": " Oct 2015 - Sep 2018",
  "education.university.line1": "BSc in Computer Science",
  "education.university.line2": "Relevant modules: Data structures and algorithms, Database management systems, Embedded systems, Distributed systems, C++, Python, Swift, JavaScript, Java, C#, .NET, WPF, UWP, WebAPI, Entity Framework, Spring, Android",
  "education.highschool": "'Spiru Haret' National College",
  "education.highschool.location": "Ploiesti, Romania",
  "education.highschool.date": " Sep 2011 - Sep 2015",
  "education.highschool.line1": "Mathematics and Programming profile with intensive Programming classes",
  "about.header.greeting": "Hi. I'm Dragoș, nice to meet you!",
  "about.welcome": "Welcome!",
  "about.intro.line1": "Welcome to my little corner of the internet. Happy to see you here! I hope you feel right at home, and that you find the 5 minutes you spend here worth your while. And since you're here, I might as well tell you a bit about myself.",
  "about.intro.line2": "Also, since you're here, we get the chance to exchange a goodwish, so here it goes:",
  "about.intro.wish": "May you be happy, may you be healthy, may you be safe and may you be at ease wherever you are in the world!",
  "about.technical.title": "On one side...",
  "about.button.fullText": "Full text",
  "about.technical.tldr.line1": "I'm a full-stack software engineer with over 5 years of hands-on experience developing scalable business web applications. My preffered tools at the moment are Angular, .NET Core, and the Azure cloud platform.",
  "about.technical.tldr.line2": " I am very comfortable working under both Windows and Unix environments and I feel right at home in the terminal. I have experience with setting up and maintaining CI/CD pipelines, infrastructure as code, and monitoring tools. I have worked with both relational and non-relational databases, with hands-on experience with Microsoft SQL Server, MongoDB, and serverless databases like Firebase.",
  "about.technical.tldr.line3": "My experience spans a variety of business projects in an Agile environment. Having been part of relatively small teams, I have had the opportunity to wear many hats, which has given me a broader view of the software development process. My experience also spans project management, sprint planning, and client communication, allowing me to work closely with stakeholders and diverse teams. ",
  "about.technical.tldr.human": "I'm also a human, passsionate about life and human stuff.",
  "about.technical.line1": "I'm a dedicated full-stack software engineer with a passion for creating seamless user experiences. I have been working in the tech industry building scalable web applications since 2017. Turning ideas into robust digital experiences that are both visually appealing and highly functional brings deep satisfaction to me and are the reason I love what I do.",
  "about.technical.line2": "With a solid foundation in Angular, .NET Core, and the Azure cloud platform, my experience spans the development of the entire application lifecycle. I have a strong understanding of software development best practices, including version control, code reviews, and continuous integration.",
  "about.technical.line3": "I am very comfortable working under both Windows and Unix environments, and I feel right at home in the terminal. I have fundamental knowledge, of Docker and I very frequently use shell tools both for work and for my, daily life. I have experience with setting up and maintaining CI/CD, pipelines, infrastructure as code, and monitoring tools. I have worked, with both relational and non-relational databases, with hands-on, experience with Microsoft SQL Server, MongoDB, and serverless databases, like Firebase.",
  "about.technical.line4": "My experience spans a variety of business projects in an agile environment. Having been part of a relatively small team, I have had the opportunity to wear many hats, which has given me a broader view of the software development process. My experience also spans project management, sprint planning, and client communication, allowing me to work closely with stakeholders and diverse teams, deciding on the best course of action, and ensuring that we are able to deliver projects in a manner that drives real business growth.",
  "about.technical.line5": "Although when I started working my focus was on back-end development, I quickly found a passion for the front-end and have since become a full-stack developer. My primary focus is now on front-end development, where I specialize in building responsive, accessible, and performant web applications. Nonetheless, I very much enjoy working on the back-end as well, where I have experience in building RESTful APIs, microservices, and serverless applications. ",
  "about.technical.line6": "I feel most satisfied me when my work is bringing value to the table by leveraging my technical skills. Both code quality and user experience are equally important to me. My value lies in my ability to understand the big picture while paying close attention to the smallest details. I'm a team player, a lifelong seeker, and a firm believer in the power of positive thinking.",
  "about.technical.line7": "Being a lifelong seeker with curiosity sitting in the driver's seat, my position is that we should never stop being students of life. Learning new things and perfecting the craft are a lifetime journey one undertakes if one wants to taste the sweet fruits this world has to offer",
  "about.personal.title": "On the other side...",
  "about.personal.line1": "I'm a strong believer in the power of the mind and the importance of self-awareness. I believe that the key to a fulfilling life is to be fully present in the moment, engaged in our activity, without being entangled in various other directions. To be grateful for what we have, to be kind to ourselves and others, to be open to new experiences, and to be willing to learn and grow from our mistakes are values that I hold dear.",
  "about.personal.line2": "When I'm not coding, you'll likely find me learning wonders of the world around me, through couses, books and podcasts. I also enjoy photography, making music, and I very much love being out near the sea. I specially enjoy biking, skating and endless walk & talk's. My daily processes involves meditating and deep thinking of ways to improve myself, the life I live, and the work I do.",
  "about.personal.line3": "I'm a firm believer in the power of positive thinking - which is none other than a solution-oriented mindset, harmoniously finding resolution in situations where it is not immediately apparent, instead of panicking because of the problem itself.",
  "about.personal.line4": "I believe that we create our own reality within our minds, and that we have the power to shape our lives in the ways we choose. The Objective Universe acting as a mirror will always be there to guide us in the right direction, even when we don't see it as such. I consider clarity of mind, purity of heart and sincerity of action as keys to unlocking the doors to the wonders of this life.",
  "about.personal.shout": "Give me a shout if you want collaborate or just to say hi! ",
  "flamingo.gleam": "Flamingo Gleam",
  "dolphin.dream": "Dolphin Dream",
  "name": "Dragoș-Andrei Iliescu",
  "job": "Full-Stack Engineer",
  "title": "EN",
  "education.highschool.line2": "Participated in various Mathematics and Programming contests",
  "education.highschool.line3": "Achieved a perfect score (10/10) in Mathematics on the Baccalaureate exam"
}