{
  "resume.title": "Dragoș-Andrei Iliescu",
  "resume.subtitle": "Full-Stack Engineer",
  "resume.sections.about.short_intro": "Full-stack software engineer with over 5 years of hands-on experience developing scalable business web applications",
  "resume.sections.about.buzzwords.key": "Buzzwords",
  "resume.sections.about.buzzwords.value": "C#, .NET Core, Web API, EF Core, SignalR, Swagger, MSSQL, Typescript, Angular, Reactive Forms, Angular Material, RxJS, NX, NativeScript, Azure Cloud Services, Azure DevOps, CI/CD, Agile, Scrum, Shell scripting, Firebase",
  "resume.sections.about.languages.key": "Languages",
  "resume.sections.about.languages.value": "Spanish  (intermediate), English (fluent), Romanian (native)",
  "resume.sections.experience.allround.date": "Sep 2021 - Aug 2023",
  "resume.sections.experience.allround.lines": [
    "Developed an ERP application to manage the client's complete business process, including factory and office operations",
    "Used NX for Angular to streamline and manage the microservices architecture.",
    "Developed the base for the web application's architecture, including core modules and components, utilities, layout and theme, security library etc.",
    "Deployed Angular and .NET microservices on client servers with Azure DevOps integrations.",
    "Set up and optimized Azure DevOps CI/CD pipelines, including pull request workflows, builds, and releases. Managed deployment environments and authored shell scripts for in the process."
  ],
  "resume.sections.experience.allround.title": "Full-Stack Engineer, Allround Zonwering",
  "resume.sections.experience.allround.location": "Elburg, Netherlands (Remote)",
  "resume.sections.experience.codecrowd.date": "Nov 2017 - Aug 2021",
  "resume.sections.experience.codecrowd.lines": [
    "Managed the end-to-end development of business features, including front-end and back-end implementation.",
    "Managed the creation and optimization of core components and modules, reusable elements and the integration of new functionalities into shared modules, being in charge of the involved architectural decisions.",
    "Developed a NativeScript application with Firebase integration. The app was used for employee schedule management, enabling users to manage different activities during their working times.",
    "Took an active role in the entire development process, including requirement gathering and feature planning within an Agile environment, participating in Scrum activities, including sprint planning, backlog refinement, and sprint reviews."
  ],
  "resume.sections.experience.codecrowd.title": "Full-Stack Engineer, The Code Crowd",
  "resume.sections.experience.codecrowd.location": "Nunspeet, Netherlands (Remote)",
  "resume.sections.experience.label": "Experience",
  "resume.sections.volunteering.itsupport.date": "Oct 2016 - Sep 2018",
  "resume.sections.volunteering.itsupport.lines": [
    "Provided on site technical support across all university departments using a ticket-based system, ensuring minimal downtime for university operations."
  ],
  "resume.sections.volunteering.itsupport.title": "University IT Support",
  "resume.sections.volunteering.itsupport.location": "Brașov, Romania",
  "resume.sections.volunteering.label": "Volunteering",
  "resume.sections.education.university.date": "Oct 2015 - Sep 2018",
  "resume.sections.education.university.lines": [
    "BSc in Computer Science",
    "Relevant modules: Data structures and algorithms, Database management systems, Embedded systems, Distributed systems, C++, Python, Swift, JavaScript, Java, C#, .NET, WPF, UWP, WebAPI, Entity Framework, Spring, Android"
  ],
  "resume.sections.education.university.title": "Transilvania University of Brașov",
  "resume.sections.education.university.location": "Brașov, Romania",
  "resume.sections.education.label": "Education",
  "about.greeting": "Hi. I'm Dragoș, nice to meet you!",
  "editor.paragraph": "Paragraph",
  "editor.heading1": "Heading 1",
  "editor.heading2": "Heading 2",
  "editor.heading3": "Heading 3",
  "editor.bold": "Bold",
  "editor.italic": "Italic",
  "editor.underline": "Underline",
  "editor.removeFormat": "Clear styles",
  "editor.alignLeft": "Align left",
  "editor.alignCenter": "Align center",
  "editor.alignRight": "Align right",
  "editor.indentLeft": "Decrease indent",
  "editor.indentRight": "Increase indent",
  "editor.hideSource": "Hide Source",
  "editor.showSource": "Show Source",
  "authWidget.greeting": "Hello, welcome!",
  "authWidget.writePost": "Write a post",
  "authWidget.signInToWrite": "Sign in to write",
  "authWidget.manageProfile": "Manage profile",
  "authWidget.signOut": "Sign out",
  "authWidget.signInWithGoogle": "Sign in with Google",
  "blog.list.tags": "Tags",
  "blog.list.authors": "Authors",
  "blog.list.resetFilters": "Reset filters",
  "blog.list.articles": "Articles",
  "blog.list.comments": "Comments",
  "blog.list.loading": "Loading",
  "blog.list.end": "End of list",
  "blog.edit.titlePlaceholder": "Title",
  "blog.edit.contentPlaceholder": "Content",
  "blog.edit.descriptionPlaceholder": "Description",
  "blog.edit.tagsPlaceholder": "Tags",
  "blog.edit.delete": "Delete",
  "blog.edit.restore": "Restore",
  "blog.edit.preview": "Preview",
  "blog.edit.save": "Save",
  "blog.edit.backToEdit": "Back to edit",
  "blog.article.comments.post": "Add comment",
  "blog.article.comments.empty": "Be the first to comment",
  "account.manage.title": "Manage Account",
  "account.manage.subtitle": "Edit account details",
  "account.manage.changePicture": "Change picture",
  "account.manage.name": "Name",
  "account.manage.errors.usernameRequired": "Username is required",
  "account.manage.errors.usernameMinlength": "Username must be at least 3 characters",
  "account.manage.email": "Email",
  "account.manage.save": "Save changes",
  "editor.textColor": "Text Color",
  "editor.backgroundColor": "Background Color",
  "blog.list.readArticle": "Read article",
  "blog.list.edit": "Edit",
  "editor.resetTextColor": "Reset Text Color",
  "editor.resetBackgroundColor": "Reset Background Color",
  "labels.resume.download": "Download CV",
  "about.sections.intro.lines": [
    "I'm a software engineer with a passion for creating seamless user experiences. I have been working in the tech industry building enterprise web applications since 2017. Turning ideas into robust digital experiences that are both visually appealing and highly functional brings deep satisfaction to me and are the reason I love what I do.",
    "With a solid foundation in Angular, .NET Core, and the Azure cloud platform, my experience spans the development of the entire application lifecycle. Good software design principles, clean code, and a strong focus on user experience are the pillars of my work and are what I strive to deliver in every project I undertake.",
    "I am very comfortable working under both Windows and Unix environments, and I feel right at home in the terminal, frequently using use shell tools both for work and for my daily life. I have a strong understanding of software development best practices, including version control, code reviews, and continuous integration.",
    "Back in 2017 when I started working, my focus was on back-end development, but I quickly found a passion for the front-end and have since become a Full-Stack developer. My primary focus is now on front-end development, but nonetheless, I very much enjoy working on the back-end as well, where I have experience in building RESTful APIs, microservices, and serverless applications.",
    "I am also familiar with the Agile methodology and have experience working in Scrum teams. Having been part of a relatively small team, I have had the opportunity to wear many hats, which has given me a broader view of the software development process. My experience also spans project management, sprint planning, and client communication, allowing me to work closely with stakeholders and diverse teams, deciding on the best course of action, and ensuring that we are able to deliver projects in a manner that drives real business growth.",
    "I feel most satisfied me when my work is bringing direct value to end users. Both code quality and user experience are equally important to me and I like having a clear view of the big picture while also paying close attention to the smallest details. I'm a team player, a lifelong seeker, and a firm believer in the power of positive thinking.",
    "I think that we should never stop being students of life. Learning new things and perfecting the craft are a lifetime journey one undertakes if one wants to taste the sweet fruits this world has to offer."
  ],
  "labels.sections.about": "About",
  "labels.sections.resume": "Resume",
  "labels.sections.blog": "Blog",
  "labels.themepicker.name": "Colors",
  "labels.themepicker.flamingo_gleam": "Flamingo Gleam",
  "labels.themepicker.dolphin_dream": "Dolphin Dream"
}