{
    "title": "ES",
    "name": "Dragoș-Andrei Iliescu",
    "job": "Desarrollador Full-Stack",
    "education": "Educación",
    "navbar.resume": "Currículum",
    "navbar.about": "Sobre mí",
    "education.university": "Universidad Transilvania de Brașov",
    "education.university.location": "Brașov, Rumanía",
    "education.university.date": " Oct 2015 - Sep 2018",
    "education.university.line1": "Licenciatura en Informática",
    "education.university.line2": "Módulos relevantes: Estructuras de datos y algoritmos, Sistemas de gestión de bases de datos, Sistemas embebidos, Sistemas distribuidos, C++, Python, Swift, JavaScript, Java, C#, .NET, WPF, UWP, WebAPI, Entity Framework, Spring, Android",
    "education.highschool": "Colegio Nacional 'Spiru Haret'",
    "education.highschool.location": " Ploiești, Rumanía",
    "education.highschool.date": " Sep 2011 - Sep 2015",
    "education.highschool.line1": "Perfil en Matemáticas y Programación con clases intensivas de Programación",
    "education.highschool.line2": "Participé en varios concursos de Matemáticas y Programación",
    "education.highschool.line3": "Obtuve una puntuación perfecta (10/10) en Matemáticas en el examen de Bachillerato",
    "experience": "Experiencia",
    "experience.allround": "Consultor IT, Allround Zonwering",
    "experience.allround.location": "Elburg, Países Bajos (Remoto)",
    "experience.allround.date": "Sep 2021 - Ago 2023",
    "experience.allround.line1": "Desarrollé una aplicación ERP para gestionar el proceso completo del negocio del cliente, incluyendo operaciones de fábrica y oficina",
    "experience.allround.line2": "Utilicé NX para Angular para optimizar y gestionar la arquitectura de microservicios.",
    "experience.allround.line3": "Desarrollé la base para la arquitectura de la aplicación web, incluyendo módulos y componentes centrales, utilidades, diseño y tema, biblioteca de seguridad, etc.",
    "experience.allround.line4": "Desplegué microservicios Angular y .NET en servidores del cliente con integraciones en Azure DevOps.",
    "experience.allround.line5": "Configuré y optimicé los pipelines CI/CD en Azure DevOps, incluyendo los flujos de trabajo de pull requests, builds y lanzamientos. Tambien gestioné entornos de deployement y escribí scripts de shell en el proceso.",
    "experience.codecrowd": "Desarrollador Full Stack, The Code Crowd",
    "experience.codecrowd.location": "Nunspeet, Países Bajos (Remoto)",
    "experience.codecrowd.date": "Nov 2017 - Ago 2021",
    "experience.codecrowd.line1": "Trabajé en un equipo internacional para desarrollar aplicaciones comerciales para clientes en los Países Bajos.",
    "experience.codecrowd.line2": "Mi función inicial se centró en solucionar pequeños errores e implementar features menores, para luego avanzar rápidamente hacia problemas y features más complejos.",
    "experience.codecrowd.line3": "Mi rol principal fue diseñar e implementar business logic y las interfaces de usuario en Angular, pero estaba involucrado en todos los aspectos del desarrollo.",
    "experience.codecrowd.line4": "Gestioné el desarrollo completo de business features, incluyendo la implementación front-end y back-end.",
    "experience.codecrowd.line5": "Gestioné la creación y optimización de componentes y módulos principales, elementos reutilizables y la integración de nuevas funcionalidades en módulos compartidos, siendo responsable de las decisiones arquitectónicas involucradas.",
    "experience.codecrowd.line6": "Desarrollé una aplicación NativeScript con integración Firebase. La aplicación se utilizó para la gestión de horarios de empleados, permitiendo a los usuarios gestionar diferentes actividades durante sus horarios de trabajo.",
    "experience.codecrowd.line7": "Participé activamente en todo el proceso de desarrollo, incluyendo recolección de requisitos y planificación de features dentro de un entorno Agile, participando en actividades de Scrum, incluyendo la planificación de sprints, la refinación del backlog y las evaluaciones de sprint.",
    "experience.buzzwords.key": "Palabras clave",
    "experience.buzzwords.value": ".NET Core, Web API, EF Core, SignalR, Swagger, MSSQL, Angular, Reactive Forms, Angular Material, RxJS, NativeScript, Azure, CI/CD, Agile, Scrum, Shell scripting, Firebase",
    "experience.languages.key": "Idiomas",
    "experience.languages.value": "Español (intermedio), Inglés (fluido), Rumano (nativo)",
    "volunteering": "Voluntariado",
    "volunteering.itsupport": "Departamento Soporte IT de la Universidad Transilvania",
    "volunteering.itsupport.location": "Brașov, Rumanía",
    "volunteering.itsupport.date": "Oct 2016 - Sep 2018",
    "volunteering.itsupport.line1": "Proporcioné soporte técnico en sitio en todos los departamentos de la universidad utilizando un sistema basado en tickets, asegurando un tiempo de inactividad mínimo para las operaciones de la universidad.",
    "volunteering.itsupport.line2": "Abordé problemas técnicos y tambien de hardware, como conectividad de red, fallos de dispositivos, configuraciones de software y hardware, rendimiento de computadoras, etc.",
    "volunteering.itsupport.line3": "Entrevisté e integré a nuevos estudiantes en el equipo, guiando y mentorando a los nuevos miembros del grupo."
}