{
  "labels": {
    "themepicker": {
      "name": "Colores",
      "flamingo_gleam": "Flamenco en resplandor",
      "dolphin_dream": "Sueño del delfín"
    },
    "sections": {
      "about": "Sobre mí",
      "resume": "Currículum"
    },
    "resume": {
      "download": "Descargar CV"
    }
  },
  "resume": {
    "title": "Dragoș-Andrei Iliescu",
    "subtitle": "Desarrollador Full-Stack",
    "sections": {
      "about": {
        "label": "Sobre",
        "short_intro": "Desarrollador de software full-stack con más de 5 años de experiencia práctica en el desarrollo de aplicaciones escalables para empresas.",
        "buzzwords.key": "Palabras clave",
        "buzzwords.value": "C#, .NET Core, Web API, EF Core, SignalR, Swagger, MSSQL, Typescript, Angular, Reactive Forms, Angular Material, RxJS, NX, NativeScript, Azure Cloud Services, Azure DevOps, CI/CD, Agile, Scrum, Shell scripting, Firebase",
        "languages.key": "Idiomas",
        "languages.value": "Español (intermedio), Inglés (fluido), Rumano (nativo)"
      },
      "experience": {
        "label": "Experiencia",
        "allround": {
          "title": "Consultor IT, Allround Zonwering",
          "location": "Elburg, Países Bajos (Remoto)",
          "date": "Sep 2021 - Ago 2023",
          "lines": [
            "Desarrollé una aplicación ERP para gestionar el proceso completo del negocio del cliente, incluyendo operaciones de fábrica y oficina",
            "Utilicé NX para Angular para optimizar y gestionar la arquitectura de microservicios.",
            "Desarrollé la base para la arquitectura de la aplicación web, incluyendo módulos y componentes centrales, utilidades, diseño y tema, biblioteca de seguridad, etc.",
            "Desplegué microservicios Angular y .NET en servidores del cliente con integraciones en Azure DevOps.",
            "Configuré y optimicé los pipelines CI/CD en Azure DevOps, incluyendo los flujos de trabajo de pull requests, builds y lanzamientos. Tambien gestioné entornos de deployement y escribí scripts de shell en el proceso."
          ]
        },
        "codecrowd": {
          "title": "Desarrollador Full Stack, The Code Crowd",
          "location": "Nunspeet, Países Bajos (Remoto)",
          "date": "Nov 2017 - Ago 2021",
          "lines": [
            "Mi rol principal fue diseñar e implementar business logic y las interfaces de usuario en Angular, pero estaba involucrado en todos los aspectos del desarrollo.",
            "Gestioné el desarrollo completo de business features, incluyendo la implementación front-end y back-end.",
            "Gestioné la creación y optimización de componentes y módulos principales, elementos reutilizables y la integración de nuevas funcionalidades en módulos compartidos, siendo responsable de las decisiones arquitectónicas involucradas.",
            "Desarrollé una aplicación NativeScript con integración Firebase. La aplicación se utilizó para la gestión de horarios de empleados, permitiendo a los usuarios gestionar diferentes actividades durante sus horarios de trabajo.",
            "Participé activamente en todo el proceso de desarrollo, incluyendo recolección de requisitos y planificación de features dentro de un entorno Agile, participando en actividades de Scrum, incluyendo la planificación de sprints, la refinación del backlog y las evaluaciones de sprint."
          ]
        }
      },
      "volunteering": {
        "label": "Voluntariado",
        "itsupport": {
          "title": "Departamento Soporte IT de la Universidad Transilvania",
          "location": "Brașov, Rumanía",
          "date": "Oct 2016 - Sep 2018",
          "lines": [
            "Proporcioné soporte técnico en sitio en todos los departamentos de la universidad utilizando un sistema basado en tickets, asegurando un tiempo de inactividad mínimo para las operaciones de la universidad."
          ]
        }
      },
      "education": {
        "label": "Educación",
        "university": {
          "title": "Universidad Transilvania de Brașov",
          "location": "Brașov, Rumanía",
          "date": "Oct 2015 - Sep 2018",
          "lines": [
            "Licenciatura en Informática",
            "Módulos relevantes: Estructuras de datos y algoritmos, Sistemas de gestión de bases de datos, Sistemas embebidos, Sistemas distribuidos, C++, Python, Swift, JavaScript, Java, C#, .NET, WPF, UWP, WebAPI, Entity Framework, Spring, Android"
          ]
        }
      }
    }
  },
  "about": {
    "greeting": "Hola. Soy Dragoș, ¡mucho gusto!",
    "sections": {
      "intro": {
        "title": "¡Bienvenido!",
        "lines": [
          "Soy ingeniero de software full-stack con más de 5 años de experiencia. Empecé mi carrera centrándome en el desarrollo back-end, pero pronto descubrí que me encantaba el front-end. Ahora, me especializo en hacer que las aplicaciones web sean responsivas y fáciles de usar, aunque todavía disfruto trabajando en proyectos de back-end.",
          "Tengo experiencia práctica con tecnologías como Angular, .NET Core y Azure. Me manejo bien tanto en entornos Windows como Unix, y conozco Docker, CI/CD y varias bases de datos como SQL Server y Firebase.",
          "A menudo colaboro estrechamente con equipos, gestiono proyectos y me aseguro de que entreguemos soluciones que realmente beneficien a nuestros clientes. Me importa tanto el panorama general como los pequeños detalles, y siempre busco producir un código de alta calidad y ofrecer excelentes experiencias de usuario.",
          "Fuera del trabajo, me gusta aprender cosas nuevas, explorar la fotografía y disfrutar del mar. Creo en el pensamiento positivo y en mantenerme curioso y abierto a nuevas experiencias."
        ],
        "wish": "Que tengas salud, que estés a salvo y que estés en paz y alegre, dondequiera que estés en el mundo!"
      },
      "technical": {
        "title": "Por un lado...",
        "tldr": {
          "title": "TL;DR",
          "lines": [
            "Soy un ingeniero de software full-stack con más de 5 años de experiencia práctica desarrollando aplicaciones web empresariales. Mis herramientas preferidas en este momento son Angular, .NET Core y la plataforma Azure.",
            "Me siento comfortable trabajando tanto en entornos Windows como Unix y me siento como en casa en la terminal. Tengo experiencia en la configuración y mantenimiento de pipelines CI/CD, infraestructura como código y herramientas de monitoreo. He trabajado con bases de datos relacionales y no relacionales, con experiencia práctica en Microsoft SQL Server, MongoDB y bases de datos sin servidor como Firebase.",
            "Mi experiencia abarca una variedad de proyectos empresariales en un entorno Agile. Al haber sido parte de un equipo relativamente pequeño, he tenido la oportunidad de desempeñar varios roles, lo que me ha dado una visión más amplia del proceso de desarrollo de software. Mi experiencia también abarca la gestión de proyectos, la planificación de sprints y la comunicación con el cliente, lo que me ha permitido trabajar cerca de los interesados y equipos diversos."
          ],
          "end_line": "También soy ser humano, apasionado por la vida y cosas humanas."
        },
        "fullText": {
          "title": "Texto completo",
          "lines": [
            "Soy un ingeniero de software full-stack dedicado, con pasión por crear experiencias de usuario fluidas. He estado trabajando en la industria tecnológica desarrollando aplicaciones web escalables desde 2017. Convertir ideas en experiencias digitales robustas, atractivas y funcionales me llena de satisfacción y es la razón por la que amo lo que hago.",
            "Con una base sólida en Angular, .NET Core y la plataforma en la nube Azure, mi experiencia abarca el ciclo completo de desarrollo de aplicaciones. Tengo un conocimiento profundo de las mejores prácticas de desarrollo de software, incluyendo control de versiones, revisiones de código e integración continua.",
            "Me siento cómodo trabajando tanto en entornos Windows como Unix, y me siento como en casa en la terminal. Tengo conocimientos básicos de Docker y uso frecuentemente herramientas de shell tanto en el trabajo como en mi día a día. Tengo experiencia configurando y manteniendo pipelines de CI/CD, infraestructura como código y herramientas de monitoreo. He trabajado con bases de datos relacionales y no relacionales, con experiencia práctica en Microsoft SQL Server, MongoDB y bases de datos serverless como Firebase.",
            "Mi experiencia abarca una variedad de proyectos empresariales en entornos ágiles. Al haber sido parte de un equipo relativamente pequeño, he tenido la oportunidad de asumir varios roles, lo que me ha dado una visión más amplia del proceso de desarrollo de software. También tengo experiencia en gestión de proyectos, planificación de sprints y comunicación con clientes, lo que me permite trabajar de cerca con stakeholders y equipos diversos, decidiendo el mejor curso de acción y asegurando que podamos entregar proyectos que impulsen un verdadero crecimiento empresarial.",
            "Aunque comencé enfocándome en el desarrollo backend, rápidamente encontré una pasión por el frontend y desde entonces me convertí en un desarrollador full-stack. Mi enfoque principal ahora es el desarrollo frontend, donde me especializo en la creación de aplicaciones web responsivas, accesibles y de alto rendimiento. Sin embargo, también disfruto trabajando en el backend, donde tengo experiencia construyendo APIs RESTful, microservicios y aplicaciones serverless.",
            "Siento mayor satisfacción cuando mi trabajo aporta valor, aprovechando mis habilidades técnicas. La calidad del código y la experiencia del usuario son igualmente importantes para mí. Mi valor reside en mi capacidad para comprender el panorama general mientras presto atención a los detalles más pequeños. Soy un jugador de equipo, un aprendiz de por vida y un firme creyente en el poder del pensamiento positivo.",
            "Siendo un aprendiz de por vida con la curiosidad al volante, creo que nunca debemos dejar de ser estudiantes de la vida. Aprender cosas nuevas y perfeccionar el oficio es un viaje de por vida que uno emprende si quiere saborear los frutos dulces que este mundo tiene para ofrecer."
          ]
        }
      },
      "personal": {
        "title": "Por otro lado...",
        "lines": [
          "Soy un firme creyente en el poder de la mente y la importancia de la autoconciencia. Creo que la clave para una vida plena es estar completamente presente en el momento, comprometido con nuestra actividad, sin dejarse arrastrar en varias direcciones. Ser agradecidos por lo que tenemos, ser amables con nosotros mismos y con los demás, estar abiertos a nuevas experiencias y estar dispuestos a aprender y crecer de nuestros errores son valores que valoro profundamente.",
          "Cuando no estoy programando, probablemente me encuentres aprendiendo sobre las maravillas del mundo a través de cursos, libros y podcasts. También disfruto de la fotografía, hacer música, y me encanta estar cerca del mar. Especialmente disfruto andar en bicicleta, patinar y tener charlas interminables mientras camino. Mi proceso diario incluye meditar y reflexionar profundamente sobre cómo mejorarme a mí mismo, la vida que llevo y el trabajo que realizo.",
          "Soy un firme creyente en el poder del pensamiento positivo, que no es más que una mentalidad orientada a soluciones, encontrando resoluciones armoniosas en situaciones donde no son inmediatamente evidentes, en lugar de entrar en pánico por el problema en sí.",
          "Creo que creamos nuestra propia realidad en nuestras mentes y que tenemos el poder de moldear nuestras vidas de la manera que elijamos. El Universo Objetivo, actuando como un espejo, siempre estará ahí para guiarnos en la dirección correcta, incluso cuando no lo veamos así. Considero que la claridad de mente, la pureza de corazón y la sinceridad en la acción son claves para abrir las puertas a las maravillas de esta vida."
        ],
        "end_line": "¡Dame un grito si quieres colaborar o simplemente saludar!"
      }
    }
  }
}