{
  "resume.title": "Dragoș-Andrei Iliescu",
  "resume.subtitle": "Desarrollador Full-Stack",
  "resume.sections.about.short_intro": "Desarrollador de software Full-Stack con más de 5 años de experiencia práctica en el desarrollo de aplicaciones escalables para empresas.",
  "resume.sections.about.buzzwords.key": "Tecnologías",
  "resume.sections.about.buzzwords.value": "C#, .NET Core, EF Core, SignalR, Swagger, MSSQL, Typescript, Angular, RxJS, NX, NativeScript, Azure DevOps, CI/CD, Firebase",
  "resume.sections.about.languages.key": "Idiomas",
  "resume.sections.about.languages.value": "Español (intermedio), Inglés (fluido), Rumano (nativo)",
  "resume.sections.experience.allround.date": "Sep 2021 - Ago 2023",
  "resume.sections.experience.allround.title": "Desarrollador Full-Stack, Allround Zonwering",
  "resume.sections.experience.allround.location": "Elburg, Países Bajos (Remoto)",
  "resume.sections.experience.codecrowd.date": "Nov 2017 - Ago 2021",
  "resume.sections.experience.codecrowd.lines": [
    "Implementé funcionalidades end-to-end para aplicaciones orientadas a empleados, como diferentes tipos de dashboards, desarrollo de CRM y sistemas de venta, gestión de inventario, gestión de recursos humanos, entre otros.",
    "Trabajé en un entorno Agile, participando activamente en la planificación y ejecución de sprints, así como en la priorización de tareas según los objetivos del proyecto.",
    "Desarrollé funcionalidades personalizadas basadas en las necesidades específicas de cada empresa.",
    "Automatizé flujos de trabajo para mejorar la eficiencia y reducir errores en el registro de datos.",
    "Optimicé el rendimiento en las aplicaciones, asegurando tiempos de carga rápidos y una experiencia de usuario fluida.",
    "Llevé a cabo la mejora continua de aplicaciones existentes, realizando refactorizaciones de código para aumentar la eficiencia y mantenibilidad del software.",
    "Analicé logs y monitoricé entornos cloud para asegurar la estabilidad del sistema, llevando a cabo sprints de corrección de errores y estabilización.",
    "Diseñé e implementé una aplicación móvil para los empleados de Boer BV, permitiéndoles registrar sus actividades diarias y planificar su trabajo. La aplicación facilitó la gestión y organización del día a día de los trabajadores, integrando actualizaciones de stock y la gestión de pedidos en tiempo real, y mejorando la eficiencia en la coordinación de las operaciones."
  ],
  "resume.sections.experience.allround.lines": [
    "Trabajé en el desarrollo de un sistema de microservicios que dirige todas las operaciones de la empresa.",
    "El sistema gestiona funciones empresariales clave, incluyendo CRM, recursos humanos, ventas, compras y producción en fábrica, con adaptaciones específicas para pantallas de tablets usadas en máquinas de corte, recubrimiento en polvo, líneas de ensamblaje etc.",
    "Desarrollé la base arquitectónica del Frontend utilizando Angular y NX, incorporando módulos de seguridad y estableciendo la infraestructura fundamental sobre cual se construyó la aplicación.",
    "Diseñé un configurador de productos complejo para el equipo de ventas, permitiendo la personalización de productos según especificaciones.",
    "Implementé pipelines de CI/CD para automatizar los despliegues y mejorar la eficiencia en el proceso de entrega de software.",
    "Participé en la organización de sprints, en la recolección de requisitos y en la planificación de características, gestionando el tiempo de desarrollo para definir prioridades y asegurar la alineación con las necesidades del cliente. ",
    "Llevé a cabo implementaciones end-to-end y seguimiento post-despliegue que aseguran la calidad y consistencia del software."
  ],
  "resume.sections.experience.codecrowd.title": "Desarrollador Full-Stack, The Code Crowd",
  "resume.sections.experience.codecrowd.location": "Nunspeet, Países Bajos (Remoto)",
  "resume.sections.experience.label": "Experiencia",
  "resume.sections.volunteering.itsupport.date": "Oct 2016 - Sep 2018",
  "resume.sections.volunteering.itsupport.lines": [
    "Proporcioné soporte técnico en sitio en todos los departamentos de la universidad utilizando un sistema basado en tickets, asegurando un tiempo de inactividad mínimo para las operaciones de la universidad."
  ],
  "resume.sections.volunteering.itsupport.title": "Soporte IT Universitario",
  "resume.sections.volunteering.itsupport.location": "Brașov, Rumanía",
  "resume.sections.volunteering.label": "Voluntariado",
  "resume.sections.education.university.date": "Oct 2015 - Sep 2018",
  "resume.sections.education.university.lines": [
    "Grado de Bachiller en Informática"
  ],
  "resume.sections.education.university.title": "Universidad Transilvania de Brașov",
  "resume.sections.education.university.location": "Brașov, Rumanía",
  "resume.sections.education.label": "Educación",
  "editor.paragraph": "Párrafo",
  "editor.heading1": "Encabezado 1",
  "editor.heading2": "Encabezado 2",
  "editor.heading3": "Encabezado 3",
  "editor.bold": "Negrita",
  "editor.italic": "Cursiva",
  "editor.underline": "Subrayar",
  "editor.removeFormat": "Limpiar estilos",
  "editor.alignLeft": "Alinear a la izquierda",
  "editor.alignCenter": "Alinear al centro",
  "editor.alignRight": "Alinear a la derecha",
  "editor.indentLeft": "Disminuir sangría",
  "editor.indentRight": "Aumentar sangría",
  "editor.hideSource": "Ocultar Código",
  "editor.showSource": "Mostrar Código",
  "timeAgo.justNow": "Justo ahora",
  "authWidget.greeting": "Hola, ¡bienvenido!",
  "authWidget.writePost": "Escribir una entrada",
  "authWidget.signInToWrite": "Inicia sesión para escribir",
  "authWidget.manageProfile": "Gestionar perfil",
  "authWidget.signOut": "Cerrar sesión",
  "authWidget.signInWithGoogle": "Iniciar sesión con Google",
  "account.manage.title": "Gestionar cuenta",
  "account.manage.subtitle": "Editar detalles de la cuenta",
  "account.manage.changePicture": "Cambiar foto",
  "account.manage.name": "Nombre",
  "account.manage.errors.usernameRequired": "El nombre de usuario es obligatorio",
  "account.manage.errors.usernameMinlength": "El nombre de usuario debe tener al menos 3 caracteres",
  "account.manage.email": "Correo electrónico",
  "account.manage.save": "Guardar cambios",
  "about.greeting": "Hola. Soy Dragoș, ¡mucho gusto!",
  "editor.textColor": "Color de Texto",
  "editor.backgroundColor": "Color de Fondo",
  "editor.resetTextColor": "Restablecer Color de Texto",
  "editor.resetBackgroundColor": "Restablecer Color de Fondo",
  "labels.resume.download": "Descargar CV",
  "labels.resume.location": "Valencia, España",
  "about.sections.intro.lines": [
    "Desarrollador Full-Stack con más de 5 años de experiencia creando aplicaciones web empresariales escalables y funcionales. Autodidacta, independiente y apasionado por la tecnología, cuento con sólidas habilidades en Angular, .NET Core y Azure Cloud, con habilidades tanto en el front-end como en el back-end. Mi rápida capacidad de aprendizaje me permiten adaptarme a diversas tecnologías y cumplir con los requisitos de cada proyecto.",
    "Mi experiencia incluye el desarrollo de aplicaciones ERP, que incluyen operaciones de fábrica, gestión interna como CRM, gestión de proyectos, recursos humanos, ventas, gestión de stock, y diseño de productos. Además, tengo experiencia desarrollando aplicaciones móviles con NativeScript.",
    "Me considero adepto a los principios de Clean Code, tales como legibilidad, simplicidad, modularidad y eficiencia del código. Poseo sólidos conocimientos en git y me siente cómodo trabajando en el terminal, con un profundo conocimiento de sistemas UNIX y Windows. En Azure DevOps, he diseñado pipelines personalizados de CI/CD y he implementado automatizaciones para optimizar los flujos de trabajo. He trabajado en entornos internacionales aplicando metodologías Agile, colaborando especialmente con equipos y clientes de los Países Bajos, gracias a mi dominio del inglés.",
    "Estoy lo más satisfecho cuando mi trabajo aporta un valor directo a los usuarios finales. Tanto la calidad del código como la experiencia del usuario son igualmente importantes para mí y me gusta tener una visión clara del panorama general, prestando también mucha atención a los detalles más pequeños. Soy un jugador de equipo, un buscador de por vida y un firme creyente en el poder del pensamiento positivo.",
    "Creo que nunca debemos dejar de ser estudiantes de la vida. Aprender cosas nuevas y perfeccionar nuestras habilidades es un viaje de por vida que uno emprende si quiere saborear los dulces frutos que este mundo tiene para ofrecer."
  ],
  "labels.sections.about": "Sobre mí",
  "labels.sections.resume": "Currículum",
  "labels.themepicker.name": "Colores",
  "labels.themepicker.flamingo_gleam": "Flamenco en resplandor",
  "labels.themepicker.dolphin_dream": "Sueño del delfín",
  "timeAgo": {
    "justNow": "Justo ahora",
    "minute": "hace un minuto",
    "minutes": "hace {{count}} minutos",
    "hour": "hace una hora",
    "hours": "hace {{count}} horas",
    "day": "hace un día",
    "days": "hace {{count}} días",
    "week": "hace una semana",
    "weeks": "hace {{count}} semanas",
    "month": "hace un mes",
    "months": "hace {{count}} meses",
    "year": "hace un año",
    "years": "hace {{count}} años"
  }
}