{
  "resume.title": "Dragoș-Andrei Iliescu",
  "resume.subtitle": "Desarrollador Full-Stack",
  "labels.resume.download": "Descargar CV",
  "resume.sections.about.short_intro": "Desarrollador de software Full-Stack con más de 5 años de experiencia práctica en el desarrollo de aplicaciones escalables para empresas.",
  "resume.sections.about.buzzwords.key": "Palabras clave",
  "resume.sections.about.buzzwords.value": "C#, .NET Core, Web API, EF Core, SignalR, Swagger, MSSQL, Typescript, Angular, Reactive Forms, Angular Material, RxJS, NX, NativeScript, Azure Cloud Services, Azure DevOps, CI/CD, Agile, Scrum, Shell scripting, Firebase",
  "resume.sections.about.languages.key": "Idiomas",
  "resume.sections.about.languages.value": "Español (intermedio), Inglés (fluido), Rumano (nativo)",
  "resume.sections.experience.allround.date": "Sep 2021 - Ago 2023",
  "resume.sections.experience.allround.lines": [
    "Desarrollé una aplicación ERP para gestionar el proceso completo del negocio del cliente, incluyendo operaciones de fábrica y oficina",
    "Utilicé NX para Angular para optimizar y gestionar la arquitectura de microservicios.",
    "Desarrollé la base para la arquitectura de la aplicación web, incluyendo módulos y componentes centrales, utilidades, diseño y tema, biblioteca de seguridad, etc.",
    "Desplegué microservicios Angular y .NET en servidores del cliente con integraciones en Azure DevOps.",
    "Configuré y optimicé los pipelines CI/CD en Azure DevOps, incluyendo los flujos de trabajo de pull requests, builds y lanzamientos. Tambien gestioné entornos de deployement y escribí scripts de shell en el proceso."
  ],
  "resume.sections.experience.allround.title": "Consultor IT, Allround Zonwering",
  "resume.sections.experience.allround.location": "Elburg, Países Bajos (Remoto)",
  "resume.sections.experience.codecrowd.date": "Nov 2017 - Ago 2021",
  "resume.sections.experience.codecrowd.lines": [
    "Gestioné el desarrollo completo de business features, incluyendo la implementación front-end y back-end.",
    "Gestioné la creación y optimización de componentes y módulos principales, elementos reutilizables y la integración de nuevas funcionalidades en módulos compartidos, siendo responsable de las decisiones arquitectónicas involucradas.",
    "Desarrollé una aplicación NativeScript con integración Firebase. La aplicación se utilizó para la gestión de horarios de empleados, permitiendo a los usuarios gestionar diferentes actividades durante sus horarios de trabajo.",
    "Participé activamente en todo el proceso de desarrollo, incluyendo recolección de requisitos y planificación de features dentro de un entorno Agile, participando en actividades de Scrum, incluyendo la planificación de sprints, la refinación del backlog y las evaluaciones de sprint."
  ],
  "resume.sections.experience.codecrowd.title": "Desarrollador Full Stack, The Code Crowd",
  "resume.sections.experience.codecrowd.location": "Nunspeet, Países Bajos (Remoto)",
  "resume.sections.experience.label": "Experiencia",
  "resume.sections.volunteering.itsupport.date": "Oct 2016 - Sep 2018",
  "resume.sections.volunteering.itsupport.lines": [
    "Proporcioné soporte técnico en sitio en todos los departamentos de la universidad utilizando un sistema basado en tickets, asegurando un tiempo de inactividad mínimo para las operaciones de la universidad."
  ],
  "resume.sections.volunteering.itsupport.title": "Departamento Soporte IT de la Universidad Transilvania",
  "resume.sections.volunteering.itsupport.location": "Brașov, Rumanía",
  "resume.sections.volunteering.label": "Voluntariado",
  "resume.sections.education.university.date": "Oct 2015 - Sep 2018",
  "resume.sections.education.university.lines": [
    "Licenciatura en Informática",
    "Módulos relevantes: Estructuras de datos y algoritmos, Sistemas de gestión de bases de datos, Sistemas embebidos, Sistemas distribuidos, C++, Python, Swift, JavaScript, Java, C#, .NET, WPF, UWP, WebAPI, Entity Framework, Spring, Android"
  ],
  "resume.sections.education.university.title": "Universidad Transilvania de Brașov",
  "resume.sections.education.university.location": "Brașov, Rumanía",
  "resume.sections.education.label": "Educación",
  "about.sections.intro.lines": [
    "Soy ingeniero de software Full-Stack con más de 5 años de experiencia creando aplicaciones para empresas. Empecé enfocado en el desarrollo back-end, pero pronto descubrí mi pasión por el front-end. Ahora me estoy dedicando a crear interfaces responsivas y fáciles de usar, aunque también disfruto trabajando el lado del servidor, ya sea construyendo APIs RESTful, configurando algo de infraestructura, leyendo unos logs para encontrar un bug o cualquier otra cosa en el medio.",
    "Tengo experiencia práctica con Angular, .NET Core y Azure. Me siento cómodo en entornos Windows y tambien Unix y me siento como en casa en la terminal. He trabajado en varios proyectos en manera Agile, donde tuve la oportunidad de llevar muchos sombreros, incluyendo gestión de proyectos, planificación de sprints y comunicación con el cliente.",
    "Mi trabajo ha involucrado una colaboración cercana entre equipos, monitoreando nuestro progreso y asegurándome de que entreguemos a tiempo y de que todos estén en la misma página. Estoy enfocado en la calidad de mi trabajo y siempre estoy curioso para aprender nuevas formas de mejorar mis habilidades."
  ],
  "about.greeting": "Hola. Soy Dragoș, ¡mucho gusto!",
  "labels.themepicker.name": "Colores",
  "labels.themepicker.flamingo_gleam": "Flamenco en resplandor",
  "labels.themepicker.dolphin_dream": "Sueño del delfín",
  "labels.sections.about": "Sobre mí",
  "labels.sections.resume": "Currículum"
}